       *** 見出し部
       IDENTIFICATION  DIVISION.

       * プログラム名
       PROGRAM-ID.     SYNTAX.


       *** 環境部
       ENVIRONMENT     DIVISION.


       *** データ部
       DATA            DIVISION.


       *** 手続き部
       PROCEDURE       DIVISION.
       *   * 画面に文字列を表示する
           DISPLAY "Coding Style & Syntax".
           STOP   RUN.
